trade_exp/src/Documents/НачислениеУдержаний/НачислениеУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5d8a03cd-d5c8-46f5-ab14-2d869dcf74d4">
  <name>НачислениеУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="16445800-7967-449f-8c66-23c16a28c879">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d6100e2-9f67-45ae-a549-786006e4950f">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e982ee89-17c2-4250-aa5e-cfb6c417006d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="81364a2d-6fde-4a09-951a-52338aa0b523">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d459c4c0-3fe2-4351-b78a-ae457b79e35d">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7397e03f-aef7-423c-86cc-3f0a146a6bae">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e816dce6-75e3-493d-9996-c99d809ef457">
      <name>СуммаЗадержки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="10358a37-0ede-4894-a3ef-241cc82251d1">
      <name>СуммаУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60dd34e3-5436-4697-a77f-64a2952a97ee">
      <name>СуммаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ec73c35f-b1e7-4dc5-8812-ee153d6cd933">
      <name>РегистраторУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/НачисленияУдержаний/НачисленияУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cb276f85-23f2-4f34-b5ad-8ff4958f4b48">
  <name>НачисленияУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="a8a6f686-64bf-486f-878a-3a2d11d1ea5a">
    <name>СуммаЗадержки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7fcb5e70-0a78-4965-ac0e-da25b7f35f36">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9eb43b5e-6086-4599-a2ee-f1b93f27250d">
    <name>СуммаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fc07c14a-9677-45ed-a7f3-c48d32cfeeee">
    <name>СуммаСторно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="92b35696-bc4b-4e39-baf2-792c4df395c3">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="1a2b70d4-deac-4462-b1b6-dd336507cf52">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2be42aa7-4d0f-4215-8085-021885108398">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7bfc9cfa-618d-41a7-a85f-18574af79ef9">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6e85eda3-b516-437b-96b7-6bdaadc191cf">
    <name>РегистраторУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/НачислениеУдержаний/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НачисленияУдержаний 
	Движения.НачисленияУдержаний.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.НачисленияУдержаний.Добавить();
		Движение.Период = Дата;
		Движение.ПериодНачисления = ПериодНачисления;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Удержание = ТекСтрокаНачисления.Удержание;
		Движение.РегистраторУдержания = ТекСтрокаНачисления.РегистраторУдержания;
		Движение.СуммаЗадержки = ТекСтрокаНачисления.СуммаЗадержки;
		Движение.СуммаУдержания = ТекСтрокаНачисления.СуммаУдержания;
		Движение.СуммаВозврата = ТекСтрокаНачисления.СуммаВозврата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли
